backend/app/models/student.rb

    def progams
        return Program.includes(:courses).where(name: self.program).as_json(include: :courses )
---
SELECT "courses".* FROM "courses" WHERE "courses"."program_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["program_id", 1], ["program_id", 2], ["program_id", 3], ["program_id", 4], ["program_id", 5], ["program_id", 6], ["program_id", 7], ["program_id", 8], ["program_id", 9], ["program_id", 10]]
SELECT "programs".* FROM "programs" WHERE "programs"."name" = $1  [["name", "IT"]]

    def total_tin_chi
        result = 0
        self.diems.includes(:course).where.not(mark: 'F').each do |t|
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 3], ["id", 1], ["id", 4], ["id", 5], ["id", 6], ["id", 7]]
SELECT "diems".* FROM "diems" WHERE "diems"."student_id" = $1 AND "diems"."mark" != $2  [["student_id", 1], ["mark", "F"]]

    def no_tin_chi
        result = 0
        self.diems.includes(:course).where(mark: 'F').each do |t|
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["id", 1], ["id", 2], ["id", 4], ["id", 5], ["id", 6], ["id", 7], ["id", 10], ["id", 11], ["id", 12], ["id", 13]]
SELECT "diems".* FROM "diems" WHERE "diems"."student_id" = $1 AND "diems"."mark" = $2  [["student_id", 1], ["mark", "F"]]

    def calcCPA
        total_diem = 0
        total_tinchi = 0

        self.diems.each do |t|
            volumn = t.course.volumn
            total_tinchi += volumn
            total_diem += volumn * Ato4(t.mark)
        end
        self.cpa = total_diem/total_tinchi
        self.save!
---
SELECT "diems".* FROM "diems" WHERE "diems"."student_id" = $1  [["student_id", 1]]
UPDATE "students" SET "cpa" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["cpa", "3.8"], ["updated_at", "2020-12-28 08:53:19.169104"], ["id", 1]]

    def getCourseByMark(mark)
        course_ids = self.diems.includes(:course).where(mark: mark).pluck(:course_id)
---
SELECT "diems"."course_id" FROM "diems" LEFT OUTER JOIN "courses" ON "courses"."id" = "diems"."course_id" WHERE "diems"."student_id" = $1 AND "diems"."mark" = $2  [["student_id", 1], ["mark", "F"]]