backend/app/controllers/students_controller.rb

    def show
        @student = Student.includes(diems: :course).find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 2], ["id", 3], ["id", 1], ["id", 4], ["id", 5], ["id", 6], ["id", 7]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def login
        @student = Student.where(number: params[:email])
        if @student.length > 0
            render json: @student.first.as_json(:methods => [:progams, :no_tin_chi, :total_tin_chi], :include => [:diems => {:include => [:course]}])
---
SELECT "students".* FROM "students" WHERE "students"."number" = $1  [["number", "123"]]
SELECT "diems".* FROM "diems" WHERE "diems"."student_id" = $1  [["student_id", 1]]

    def help
        @student = Student.includes(diems: :course).find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 2], ["id", 3], ["id", 1], ["id", 4], ["id", 5], ["id", 6], ["id", 7]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]